SaitovSP/src/Catalogs/ПричиныОтказаОтБлюд/ПричиныОтказаОтБлюд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныОтказаОтБлюд</name>
</mdclass:Catalog>

SaitovSP/src/InformationRegisters/ИсторияОтказовОтБлюд/ИсторияОтказовОтБлюд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияОтказовОтБлюд</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Причина</name>
    <type>
      <types>CatalogRef.ПричиныОтказаОтБлюд</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Блюдо</name>
    <type>
      <types>CatalogRef.Блюда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Повар</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/Catalogs/ПричиныОтказаОтБлюд/Forms/ФормаВыбора/Module.bsl
&НаКлиенте
Процедура ДобавитьНовуюПричинуОтказа(Команда)
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ПричиныОтказаОтБлюд.ФормаОбъекта",,,,,,Оп);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания(Результать, Параметры) Экспорт
	
	ОбновитьСписок();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьСписок();
	
КонецПроцедуры

Процедура ОбновитьСписок()
	
	ПричинаОтказаТЗ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныОтказаОтБлюд.Ссылка КАК ПричинаОтказа,
		|	КОЛИЧЕСТВО(ИсторияОтказовОтБлюд.Причина) КАК Причина
		|ИЗ
		|	Справочник.ПричиныОтказаОтБлюд КАК ПричиныОтказаОтБлюд
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияОтказовОтБлюд КАК ИсторияОтказовОтБлюд
		|		ПО ПричиныОтказаОтБлюд.Ссылка = ИсторияОтказовОтБлюд.Причина
		|
		|СГРУППИРОВАТЬ ПО
		|	ПричиныОтказаОтБлюд.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Причина УБЫВ"
		;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ПричинаОтказаТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьОВыборе(Элементы.ПричинаОтказаТЗ.ТекущиеДанные.ПричинаОтказа);
	
КонецПроцедуры
